/**
  ******************************************************************************
  * @file    led.h
  * @author  xxx
  * @version Vx.x
  * @date    xxxx-xx-xx
  * @brief   xxx.
  ******************************************************************************
  * @attention
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __LED_H
#define __LED_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* 控制LEDB(直接操作寄存器) */
#define LEDB_TOGGLE  GPIOB->ODR ^= GPIO_Pin_13    // PE7输出相反状态 - LEDR状态反转
#define LEDB_OFF     GPIOB->BSRR = GPIO_Pin_13    // PE7输出高电平 - LEDR关
#define LEDB_ON      GPIOB->BRR  = GPIO_Pin_13    // PE7输出低电平 - LEDR开


/* Exported functions ------------------------------------------------------- */
void LED_Cfg(void);															 //声明函数

#endif /* __LED_H */
/******************************** END OF FILE *********************************/
